Embedfire/ebf_fsp_ra6m5_code/EBF_Workspace_Keil/19_UART_Circular_Queue/src/hal_entry.c
#include "hal_data.h"

FSP_CPP_HEADER
void R_BSP_WarmStart(bsp_warm_start_event_t event);
FSP_CPP_FOOTER


/* 用户头文件包含 */
#include "led/bsp_led.h"
#include "debug_uart/bsp_debug_uart.h"
#include "debug_uart/circular_queue.h"


/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    /* TODO: add your own code here */

    uint8_t Read_Buffer[DATA_LEN];
    uint16_t Read_Length;

    LED_Init();         // LED 初始化
    Debug_UART4_Init(); // SCI4 UART 调试串口初始化
    Queue_Init((Circular_queue_t*)&Circular_queue); //环形队列初始化

    printf("这是一个串口环形队列例程\r\n");
    printf("打开串口助手发送数据 5 个及以上的数据，接收窗口会打印所发送的数据\r\n");

    while(1)
    {
        if (Queue_isEmpty(&Circular_queue) == false)  //判断队列中的数据不为空
        {
            Read_Length = Queue_HadUse(&Circular_queue);
            if( Read_Length >= 5)       // 如果队列中的数据大于等于5个，开始打印队列中的所有数据
            {
                printf("Read_Length=%d: ", Read_Length);
                memset(Read_Buffer, 0, DATA_LEN);
                /* 读出 Read_Length 个数据 */
                Queue_Read(&Circular_queue, Read_Buffer, Read_Length);
                printf("%s\r\n", Read_Buffer);
            }
        }

        R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_MILLISECONDS);
    }


#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}

/*******************************************************************************************************************//**
 * This function is called at various points during the startup process.  This implementation uses the event that is
 * called right before main() to set up the pins.
 *
 * @param[in]  event    Where at in the start up process the code is currently at
 **********************************************************************************************************************/
void R_BSP_WarmStart(bsp_warm_start_event_t event)
{
    if (BSP_WARM_START_RESET == event)
    {
#if BSP_FEATURE_FLASH_LP_VERSION != 0

        /* Enable reading from data flash. */
        R_FACI_LP->DFLCTL = 1U;

        /* Would normally have to wait tDSTOP(6us) for data flash recovery. Placing the enable here, before clock and
         * C runtime initialization, should negate the need for a delay since the initialization will typically take more than 6us. */
#endif
    }

    if (BSP_WARM_START_POST_C == event)
    {
        /* C runtime environment and system clocks are setup. */

        /* Configure pins. */
        R_IOPORT_Open (&g_ioport_ctrl, g_ioport.p_cfg);
    }
}

#if BSP_TZ_SECURE_BUILD

BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ();

/* Trustzone Secure Projects require at least one nonsecure callable function in order to build (Remove this if it is not required to build). */
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ()
{

}
#endif
